app/Controllers/AdminController.php

    public function profile($agent_id){

        $user_db  = new UserModel();
        $delivery_db  = new DeliveryModel();
        $data = [];



        // do some the validation
        if(empty($agent_id)){
            return redirect()->back()->with("error", "Invalid request");
        } else {
            // Protect the profile
            if($agent_id == session()->get('userData')[0]['adminId'] || session()->get('userData')[0]['userRole'] == 'admin'){
                // Query or fetch the data
                $data['user'] = $user_db->where('adminId', $agent_id)->find();
                if(empty($data['user'])){
                    return redirect()->back()->with("error", "Data doesn't exist");
                }
            }
        }

        // get the total pending log of the
        $data['pending_log_count'] = $delivery_db->table('agent_assignments')
            ->select('agent_assignments.*')
            ->join('order', "order.orderCode = agent_assignments.order_code")
            ->join('customer_table', "customer_table.orderCode = order.orderCode")
            ->where('agent_assignments.agent_id', $agent_id)
            ->where('agent_assignments.isDeliver', 0)
            ->groupBy('agent_assignments.order_code')
            ->orderBy("agent_assignments.agent_id", "DESC")
            ->countAllResults();

        $data['delivered_log_count'] = $delivery_db->table('agent_assignments')
            ->select('agent_assignments.*')
            ->join('order', "order.orderCode = agent_assignments.order_code")
            ->join('customer_table', "customer_table.orderCode = order.orderCode")
            ->where('agent_assignments.agent_id', $agent_id)
            ->where('agent_assignments.isDeliver', 1)
            ->groupBy('agent_assignments.order_code')
            ->orderBy("agent_assignments.agent_id", "DESC")
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `agent_assignments`.*
FROM `agent_assignments`
JOIN `order` ON `order`.`orderCode` = `agent_assignments`.`order_code`
JOIN `customer_table` ON `customer_table`.`orderCode` = `order`.`orderCode`
WHERE `agent_assignments`.`agent_id` = '2'
AND `agent_assignments`.`isDeliver` = 0
GROUP BY `agent_assignments`.`order_code`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `agent_assignments`.*
FROM `agent_assignments`
JOIN `order` ON `order`.`orderCode` = `agent_assignments`.`order_code`
JOIN `customer_table` ON `customer_table`.`orderCode` = `order`.`orderCode`
WHERE `agent_assignments`.`agent_id` = '2'
AND `agent_assignments`.`isDeliver` = 1
GROUP BY `agent_assignments`.`order_code`
) CI_count_all_results