app/Controllers/DashboardController.php

    public function index()
    {
        $data = [];

        $sale_db = new SaleModel();
        $order_db = new CustomerModel();
        $product_db = new ProductsModel();
        $order_db = new OrderModel();


        // get all the products
        $data['products'] = $product_db->findAll();
        //get all orders
        $data['SaleModel'] = $order_db->findAll();


        //get all the sales
        $data['all_sales']  = $sale_db->table('sale_table')
                                    ->select('*')
                                    ->join('products_table', 'products_table.prodId = sale_table._product')
                                    ->get()
                                    ->getResult();

        $data['ld_sale'] = $sale_db->selectSum('_amount')->where('_currency', "LRD")->get()->getResult();
        $data['usd_sale'] = $sale_db->selectSum('_amount')->where('_currency', "USD")->get()->getResult();
---
SELECT *
FROM `order`
SELECT *
FROM `sale_table`
JOIN `products_table` ON `products_table`.`prodId` = `sale_table`.`_product`
SELECT SUM(`_amount`) AS `_amount`
FROM `sale_table`
WHERE `_currency` = 'LRD'
SELECT SUM(`_amount`) AS `_amount`
FROM `sale_table`
WHERE `_currency` = 'USD'