app/Controllers/Home.php

SELECT *
FROM `delivery_regions`
SELECT *
FROM `products_table`
JOIN `categories` ON `categories`.`categoryId` = `products_table`.`prodCategory`
WHERE `products_table`.`prodAvailabilityStatus` = 'Available'
ORDER BY `products_table`.`prodId` DESC
 LIMIT 9
SELECT *
FROM `products_table`
JOIN `categories` ON `categories`.`categoryId` = `products_table`.`prodCategory`
WHERE `products_table`.`prodAvailabilityStatus` = 'In-Route'
ORDER BY `products_table`.`prodId` DESC
 LIMIT 6
---
    public function index()
    {
    $product_db = new ProductsModel();
    $category_db = new CategoryModel();
    $location_db = new DeliveryRegions();
    $data['delivery_location'] = $location_db->findAll();

    // this query all the products that are available in the store
    $data['all_products'] = $product_db->table('products_table')
                            ->select('*')
                            ->join('categories', 'categories.categoryId = products_table.prodCategory')
                            ->where('products_table.prodAvailabilityStatus', 'Available')
                            ->orderBy('products_table.prodId', 'desc')
                            ->limit(9)
                            ->get()
                            ->getResult();

    // this query gets all the products which are in routes
    $data['pre_order_products'] = $product_db->table('products_table')
                            ->select('*')
                            ->join('categories', 'categories.categoryId = products_table.prodCategory')
                            ->where('products_table.prodAvailabilityStatus', 'In-Route')
                            ->orderBy('products_table.prodId', 'desc')
                            ->limit(6)
                            ->get()
                            ->getResult();